jedsada-github/Emone/stm32f4-disc1/STM32F4-iMAS923TH_REV01/Inc/STM32F4xx_Inc/gpio.h
/**
 ******************************************************************************
 * File Name          : gpio.h
 * Description        : This file contains all the functions prototypes for
 *                      the gpio
 ******************************************************************************
 * This notice applies to any and all portions of this file
 * that are not between comment pairs USER CODE BEGIN and
 * USER CODE END. Other portions of this file, whether
 * inserted by the user or by software development tools
 * are owned by their respective copyright owners.
 *
 * Copyright (c) 2018 STMicroelectronics International N.V.
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted, provided that the following conditions are met:
 *
 * 1. Redistribution of source code must retain the above copyright notice,
 *    this list of conditions and the following disclaimer.
 * 2. Redistributions in binary form must reproduce the above copyright notice,
 *    this list of conditions and the following disclaimer in the documentation
 *    and/or other materials provided with the distribution.
 * 3. Neither the name of STMicroelectronics nor the names of other
 *    contributors to this software may be used to endorse or promote products
 *    derived from this software without specific written permission.
 * 4. This software, including modifications and/or derivative works of this
 *    software, must execute solely and exclusively on microcontroller or
 *    microprocessor devices manufactured by or for STMicroelectronics.
 * 5. Redistribution and use of this software other than as permitted under
 *    this license is void and will automatically terminate your rights under
 *    this license.
 *
 * THIS SOFTWARE IS PROVIDED BY STMICROELECTRONICS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS, IMPLIED OR STATUTORY WARRANTIES, INCLUDING, BUT NOT
 * LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY, FITNESS FOR A
 * PARTICULAR PURPOSE AND NON-INFRINGEMENT OF THIRD PARTY INTELLECTUAL PROPERTY
 * RIGHTS ARE DISCLAIMED TO THE FULLEST EXTENT PERMITTED BY LAW. IN NO EVENT
 * SHALL STMICROELECTRONICS OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
 * LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA,
 * OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF
 * LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING
 * NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE,
 * EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 *
 ******************************************************************************
 */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __GPIO_H
#define __GPIO_H

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_hal.h"

/* Private defines -----------------------------------------------------------*/
#define CS_I2C_SPI_Pin                   GPIO_PIN_3
#define CS_I2C_SPI_GPIO_Port             GPIOE
#define PC14_OSC32_IN_Pin                GPIO_PIN_14
#define PC14_OSC32_IN_GPIO_Port          GPIOC
#define PC15_OSC32_OUT_Pin               GPIO_PIN_15
#define PC15_OSC32_OUT_GPIO_Port         GPIOC
#define PH0_OSC_IN_Pin                   GPIO_PIN_0
#define PH0_OSC_IN_GPIO_Port             GPIOH
#define PH1_OSC_OUT_Pin                  GPIO_PIN_1
#define PH1_OSC_OUT_GPIO_Port            GPIOH
#define OTG_FS_PowerSwitchOn_Pin         GPIO_PIN_0
#define OTG_FS_PowerSwitchOn_GPIO_Port   GPIOC
#define PDM_OUT_Pin                      GPIO_PIN_3
#define PDM_OUT_GPIO_Port                GPIOC
#define B1_Pin                           GPIO_PIN_0
#define B1_GPIO_Port                     GPIOA
#define I2S3_WS_Pin                      GPIO_PIN_4
#define I2S3_WS_GPIO_Port                GPIOA
#define SPI1_SCK_Pin                     GPIO_PIN_5
#define SPI1_SCK_GPIO_Port               GPIOA
#define SPI1_MISO_Pin                    GPIO_PIN_6
#define SPI1_MISO_GPIO_Port              GPIOA
#define SPI1_MOSI_Pin                    GPIO_PIN_7
#define SPI1_MOSI_GPIO_Port              GPIOA
#define BOOT1_Pin                        GPIO_PIN_2
#define BOOT1_GPIO_Port                  GPIOB
#define LORA_RXD_Pin                     GPIO_PIN_10
#define LORA_RXD_GPIO_Port               GPIOB
#define LORA_TXD_Pin                     GPIO_PIN_11
#define LORA_TXD_GPIO_Port               GPIOB
#define LD4_Pin                          GPIO_PIN_12
#define LD4_GPIO_Port                    GPIOD
#define LD3_Pin                          GPIO_PIN_13
#define LD3_GPIO_Port                    GPIOD
#define LD5_Pin                          GPIO_PIN_14
#define LD5_GPIO_Port                    GPIOD
#define LD6_Pin                          GPIO_PIN_15
#define LD6_GPIO_Port                    GPIOD
#define I2S3_MCK_Pin                     GPIO_PIN_7
#define I2S3_MCK_GPIO_Port               GPIOC
#define VBUS_FS_Pin                      GPIO_PIN_9
#define VBUS_FS_GPIO_Port                GPIOA
#define OTG_FS_ID_Pin                    GPIO_PIN_10
#define OTG_FS_ID_GPIO_Port              GPIOA
#define OTG_FS_DM_Pin                    GPIO_PIN_11
#define OTG_FS_DM_GPIO_Port              GPIOA
#define OTG_FS_DP_Pin                    GPIO_PIN_12
#define OTG_FS_DP_GPIO_Port              GPIOA
#define SWDIO_Pin                        GPIO_PIN_13
#define SWDIO_GPIO_Port                  GPIOA
#define SWCLK_Pin                        GPIO_PIN_14
#define SWCLK_GPIO_Port                  GPIOA
#define I2S3_SCK_Pin                     GPIO_PIN_10
#define I2S3_SCK_GPIO_Port               GPIOC
#define I2S3_SD_Pin                      GPIO_PIN_12
#define I2S3_SD_GPIO_Port                GPIOC
#define Audio_RST_Pin                    GPIO_PIN_4
#define Audio_RST_GPIO_Port              GPIOD
#define OTG_FS_OverCurrent_Pin           GPIO_PIN_5
#define OTG_FS_OverCurrent_GPIO_Port     GPIOD
#define SWO_Pin                          GPIO_PIN_3
#define SWO_GPIO_Port                    GPIOB
#define Audio_SCL_Pin                    GPIO_PIN_6
#define Audio_SCL_GPIO_Port              GPIOB
#define Audio_SDA_Pin                    GPIO_PIN_9
#define Audio_SDA_GPIO_Port              GPIOB
#define MEMS_INT2_Pin                    GPIO_PIN_1
#define MEMS_INT2_GPIO_Port              GPIOE

/* GPIO init function --------------------------------------------------------*/
void MX_GPIO_Init(void);

#endif /* __GPIO_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
